app/Controllers/Dashboard.php

SELECT *
FROM `pengumuman`
---
    public function index()
    {
        // $count = $this->model->countAllResults();
        $data['countsiswa'] = $this->model->countAllResults();
        $data['countguru'] = $this->guru->where('jabatan', 'guru')->countAllResults();
        $data['datasiswa'] = $this->model->find();
        $data['dosen0072'] = $this->pengumumanmodel->find();